Steps involved in Data Preprocessing

1. Import the library
2. Read the Data Set
3. handle the missing value
4. split the data to X and Y
5. Handle the Categorical Data
6. Split Data to Train and Test
7. Apply Feature Scaling
8. Convert the Data to String or INT, Approporate to the Senario

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

>> if the daa set has unique values it can't be used for machine leaning model, for eg, Name, Roll Number

In [4]:
df = pd.read_csv('Churn_Modelling.csv')

In [6]:
df.head(10)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42.0,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,225,NaN,Female,41.0,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,629,France,Female,42.0,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39.0,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43.0,2,125510.82,1,1,1,79084.10,0
5,6,15574012,Chu,645,Spain,Male,44.0,8,113755.78,2,1,0,149756.71,1
6,7,15592531,Bartlett,619,France,Male,50.0,7,0.00,2,1,1,10062.80,0
7,8,15656148,Obinna,376,Germany,NaN,NaN,4,115046.74,4,1,0,119346.88,1
8,9,15792365,He,501,France,Male,44.0,4,142051.07,2,0,1,74940.50,0
9,10,15592389,H?,684,France,Male,43.0,2,134603.88,1,1,1,71725.73,0

In [7]:
#Checking the Null Values

df.isnull().any()

RowNumber          False
CustomerId         False
Surname            False
CreditScore        False
Geography           True
Gender              True
Age                 True
Tenure             False
Balance            False
NumOfProducts      False
HasCrCard          False
IsActiveMember     False
EstimatedSalary    False
Exited             False
dtype: bool

In [8]:
df.isnull().sum()

RowNumber          0
CustomerId         0
Surname            0
CreditScore        0
Geography          1
Gender             1
Age                1
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

How to manage Null Values?
    - drop the column
    - fill with your own value
    - fill with median mean or mode
when we will drop the comlum
    - if our data set has hald of the null values means we can do this apprioach

#How to Drop the Colums


df.drop(["Name_of_column"], axis = 1)    #axis = 1 -> "is Column "O" is Row"
df.drop(["Name_of_column"], axis = 1, 1) #add inplace of 1 to save the changes in data

In [ ]:
# How to Remove the Row, the only row has a null value

In [9]:
#dataset.[dataset["Geography"].isnull()].index.tolist()

In [ ]:
#Fill with a own Value

df.fillna("abc")

In [10]:
df["Geography"].fillna(df["Geography"].mode()[0], inplace = True)

In [11]:
df["Gender"].fillna(df["Gender"].mode()[0], inplace = True)

In [12]:
df["Age"].fillna(df["Age"].mean(), inplace = True)

In [13]:
df

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42.0,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,225,France,Female,41.0,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,629,France,Female,42.0,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39.0,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43.0,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,15606229,Obijiaku,771,France,Male,39.0,5,0.00,2,1,0,96270.64,0
9996,9997,15569892,Johnstone,516,France,Male,35.0,10,57369.61,1,1,1,101699.77,0
9997,9998,15584532,Liu,709,France,Female,36.0,7,0.00,1,0,1,42085.58,1
9998,9999,15682355,Sabbatini,772,Germany,Male,42.0,3,75075.31,2,1,0,92888.52,1
9999,10000,15628319,Walker,792,France,Female,28.0,4,130142.79,1,1,0,38190.78,0

In [14]:
df.isnull().any()

RowNumber          False
CustomerId         False
Surname            False
CreditScore        False
Geography          False
Gender             False
Age                False
Tenure             False
Balance            False
NumOfProducts      False
HasCrCard          False
IsActiveMember     False
EstimatedSalary    False
Exited             False
dtype: bool

# Split the data for Input and OutPut

In [19]:
#explicitly mentio the each row
#x = df.iloc[:, [2, 3, 4, 5]] # 2, 3, 4, 5 are the only rows if we want

x = df.iloc[:, 3:13]
y = df.iloc[:, 13]

In [20]:
type(x)

pandas.core.frame.DataFrame

In [21]:
# we need to convert into arrays, then only we can able to 
# apply to the machine learning models, we can only visualise the 
# pandas dataframe, we can't predict

x = df.iloc[:, 3:13].values
y = df.iloc[:, 13].values

In [22]:
type(x)

numpy.ndarray

# Handling the categorical data

In [24]:
df["Geography"].unique()

array(['France', 'Spain', 'Germany'], dtype=object)

In [25]:
df["Gender"].unique()

array(['Female', 'Male'], dtype=object)

In [41]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer

In [42]:
x[0]

array([619, 'France', 'Female', 42.0, 2, 0.0, 1, 1, 1, 101348.88],
      dtype=object)

In [45]:
ct = ColumnTransformer(["oh", OneHotEncoder(),[1, 2], remainder = "passthrough" ])
x = ct.fit_transform(x)

SyntaxError: invalid syntax (<ipython-input-45-a080d4a59cf3>, line 1)

TypeError: 'type' object is not iterable